{
  "id": "ble-multipath-fading-ml",
  "title": "Using MATLAB to simulate BLE with multipath fading with interference and machine learning",
  "excerpt": "A simulation project that analyzes how BLE jamming affects machine learning models trained to process BLE data using MATLAB.",
  "content": "I just made this for my university assignment, a simulation project that analyzes how BLE jamming affects machine learning models trained to process BLE data. Using MATLAB, I built and evaluated models that demonstrate the impact of interference. I will go through the development process of this project in this blog.\n\n[This is the github page of the project.](https://github.com/BurningZilch/BLE-jamming-simulation)\n\n## **Project Overview**\n\nThis project was part of my university assessment to:\n\n1. Simulate BLE environments with varying interference.\n2. Train and evaluate machine learning models (CNN and RF) using simulated BLE data.\n\n## **Step 1: Planning**\n\nAfter research, I outlining the key components of the simulation:\n\n1. **BLE Environment**: Simulating BLE signals under normal and jammed conditions.\n2. **Dataset Generation**: Creating synthetic data to train machine learning models.\n3. **Model Training and Testing**: Using CNN and Random Forest models to analyze the impact of interference.\n\nIn order to make this project works, I decide to follow the path of Kent Beck: Make it work, make it right, make it fast.\n\n## **Step 2: Make it Work**\n\nMy teammate Eli created a file called `bigeli.stl` as a testing environment—a simple room with one wall. I decided to use **ray tracing** to calculate the **multipath fading model** for path loss. To test this, I placed two BLE devices in the room.\n\n![eliroom](/assets/img/eliroom.png)\n\nTo build the foundation of this simulation, I modified MATLAB example code and created three main classes:\n\n1. **BLE Device**: Represents the BLE transmitter/receiver.\n2. **Connection Channel**: Models the path between devices, including multipath fading.\n3. **Waveform**: Simulates the BLE signal waveform for analysis.\n\nAt this stage, I simplified the setup to calculate RSSI values **without noise or real-world factors**. This allowed me to save time and focus on presenting preliminary results during our midterm meeting. Using the gathered RSSI values from three beacons, I trained a simple **Random Forests (RF)** machine learning model to predict signal strength.\n\n## **Step 3: Make it Right**\n\nAfter proving the concept worked, I refined the simulation to make it more realistic:\n\n**Adding Noise and Jamming**:\nI integrated interference signals into the connection channel to simulate **jamming interference**. This required creating a jammer class that added controlled noise to the BLE waveform.\n\n![BLEattack](/assets/img/BLEattack.png)\n\n**Realistic RSSI Calculations**:\nI updated the RSSI calculations to include real-world factors like environmental noise, signal reflections, and fading. This made the simulation results closer to what BLE devices experience in practice.\n\n![resultwave](/assets/img/resultwave.png)\n\n**Improved Model Training**:\nWith the updated dataset, I trained a **Convolutional Neural Network (CNN)** in addition to the RF model. The CNN was designed to capture more intricate patterns in the BLE data, making it potentially more resilient to interference. Due to the time limit, the ML model did not works well, but the experiment still shows the potential for affect ML using simulations BLE with jamming interference\n\n![result3d](/assets/img/result3d.png)\n\nFeel free to comment or reach out with questions—I'd love to hear your thoughts!",
  "date": "2024-11-25T00:00:00.000Z",
  "author": "Ash",
  "tags": ["MATLAB", "BLE", "Machine Learning"],
  "featuredImage": "/assets/img/BLE.png",
  "slug": "ble-multipath-fading-ml"
}
